Examinator/src/Documents/ПроведениеПрограммыОбученияСУО/ПроведениеПрограммыОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеПрограммыОбученияСУО</name>
  <basedOn>Catalog.КаталогПрограммОбученияСУО</basedOn>
  <registerRecords>InformationRegister.ОткрытыеПрограммыОбученияСУО</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПроведенияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>БезСценария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.КаталогПрограммОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытаяПрограмма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляВсех</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗаявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоУчастников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляУчастника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляМенеджера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОткрытойПрограммыДляУчастника</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляРуководителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросНаОбучение</name>
    <type>
      <types>DocumentRef.ЗапросНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляУчастника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаКопирования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчебныеГруппы</name>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Должности</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодразделенияПредприятия</name>
    <attributes>
      <name>ПодразделениеПредприятия</name>
      <type>
        <types>CatalogRef.ПодразделенияПредприятияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоДокументаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Documents/ПроведениеПрограммыОбученияСУО/Forms/ФормаСоздания/Module.bsl
#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// На основе программы обучения

&НаКлиенте
Процедура НаОсновеПрограммыОбучения(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПровестиПрограммуОбучениеНаОсновеСценарияПродолжение", ЭтотОбъект);	
	
	ОткрытьФорму("Справочник.КаталогПрограммОбученияСУО.ФормаВыбора",,,,,,ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ПровестиПрограммуОбучениеНаОсновеСценарияПродолжение(ВыбраннаяПрограммаОбучения, ДополнительныеПараметры) Экспорт
	
	Если ВыбраннаяПрограммаОбучения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть();
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("ПрограммаОбучения, БезСценария", ВыбраннаяПрограммаОбучения, Ложь));
	ОткрытьФорму("Документ.ПроведениеПрограммыОбученияСУО.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

// Без сценария

&НаКлиенте
Процедура БезСценария(Команда)
	
	Закрыть();
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("БезСценария", Истина));
	ОткрытьФорму("Документ.ПроведениеПрограммыОбученияСУО.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти
